{"data": [{"title": "Product Histories", "paragraphs": [{"context": "Basecamp. Basecamp. On our website, we say Basecamp is a private, secure space online where people working together can organize and discuss everything they need to get a project done. See it, track it, discuss it, act on it. Tasks, discussions, deadlines, and files — everything’s predictably organized in Basecamp. But we want it to be more than that. In mid-2016, we decided to focus on helping small business owners manage their businesses and help alleviate growth and organizational pains they’re facing. Project management was our bread and butter for over 15 years. But we were inspired by how we, internally, have used Basecamp to run 37signals, and we want to extend that philosophy to our current customers and scores of brand-new customers."}, {"context": "But let’s take a look back. In 2003, 37signals was a web design firm made up of 4 people. We always had work, but we were disorganized. With so many concurrent projects, things began to slip through the cracks. Projects dragged on too long. We dropped the ball on key deliverables. We had some major miscommunication. As many people even still do, we relied on email for everything. Things inevitably got lost, people get left out of conversations, there’s nowhere to go to see what’s left to do."}, {"context": "So we started looking for a project management tool. We tried a few tools, but they were complicated and didn’t fit what we needed. Frustrated, we decided to build our own simple project management app. A few months later we had something ready, and we immediately started using this tool with our existing clients."}, {"context": "Lo and behold, our projects ran better! We regained the sense of order and calmness we’d been craving. And clients noticed — they really appreciated the improved communication and organization. Soon after, our clients started asking us what software we were using to run these projects. Turns out they wanted to use it for their own in-house projects! So, we polished it up and put it on the market. On February 5th, 2004, Basecamp was born, and within a year, Basecamp was generating more income for us than our web design business, so we shuttered the web design firm to focus solely on Basecamp. That original Basecamp is called Basecamp Classic, and it still retains quite a few loyal customers! In 2012, we released our second version of Basecamp, referred to as BCX."}, {"context": "Fast forward to 2014. We’d been feeling pulled in too many directions for too long. Campfire, Highrise, Backpack, and a host of other products were taking away from what we really wanted to do: maintain and improve Basecamp. So we spun off, sold, or otherwise sunset our ancillary products, and dedicated the entire company’s efforts to Basecamp. In 2015 we launched our third version of Basecamp, BC3, and in 2022, we launched Basecamp 4."}, {"context": "HEY. HEY is our love letter to email. While our internal communications are almost exclusively in Basecamp (with code reviews in GitHub the primary exception), we still correspond with some external service providers and customers via email. Every time we needed to do that, we felt the drag: how much harder it was to manage and stay on top of email. So we eventually decided to do something about it. After over two years of work, we launched HEY in June 2020."}, {"context": "Highrise. In 2014, we decided to spin off or sell our other (very successful!) applications. One of those was Highrise, our customer relationship management (CRM) tool. Highrise became a subsidiary of 37signals run by its own board, executive, and staff. In 2018, we took back control of Highrise, disbanded the separate company, and turned off new signups. Highrise is now, as Basecamp Classic, Basecamp 2, Backpack, and Campfire, part of our until-the-end-of-the-internet legacy. Maintained for existing customers, but no longer developed for new features or new customers."}, {"context": "Ta-da List. Ten years ago, to-do list apps were few and far between. So, we created Ta-da List as a stand alone free subscription app at tadalist.com in January 2005. Now that people have to-do lists on their phones, desktops, laptops, tablets, and refrigerator doors, we recognized that Ta-da List was a little outdated. We closed new signups to tadalist.com in 2012, but existing customers were able to retain their accounts."}, {"context": "Backpack. We created Backpack in May 2005 as a supplement to Basecamp Classic. Backpack existed as an organizer: “a place to keep life’s loose ends together”. Users could make lists, notes, add files, upload pictures, and create Writeboards to share with other users. When we restructured in 2014, we closed Backpack to new customers, but existing customers still use (and love!) Backpack."}, {"context": "Writeboard. A tool called Writeboards lives in Basecamp Classic and Backpack. A Writeboard functions as a very simple, minimally formattable text document. In October 2005, we launched Writeboards.com, so people who wanted to use the tool without a Basecamp or Backpack subscription could do so. We retired Writeboards.com in 2014, but they still work in existing Basecamp Classic and Backpack accounts."}, {"context": "Campfire. In 2006, we built Campfire to help businesses communicate better. It’s a simple, real-time web-based group chat tool that lets people set up password-protected chat rooms super quickly. At the very beginning, it didn’t integrate with Basecamp, but when it did, it took off. Signups for Campfire were closed in February 2017."}, {"context": "37signals Suite. The 37signals Suite was a bundle of Basecamp Classic, Highrise, Backpack, and Campfire that allowed businesses to get big savings across the apps, simplify billing, and unify users across the apps. We retired the 37signals Suite offering after BCX was launched. Breeze. In 2012, we launched Echo, which turned into Breeze, a mailing list tool for small groups. We were excited about it, tried for a year to build up the product and bring in customers, but the product didn’t take off like we hoped it would. Only about 1,200 customers signed up in that year, so rather than watch it limp along, we closed it down in August 2013."}, {"context": "Unlike our other retired products, we refunded our customers’ money and closed the product entirely so not even existing customers could retain their subscription. We directed them to other small scale mailing list alternatives and apologized for the hiccup. WeWorkRemotely.com. 37signals has run a job board since 2006, helping connect small businesses with good designers and programmers for full-time jobs, freelance gigs, and internships."}, {"context": "In 2014, 37signals revamped our job board and launched We Work Remotely. After Jason and David published their book REMOTE, we realized we wanted to be on the forefront of promoting remote work. So, we created and hosted WeWorkRemotely.com, which contains job postings for programmers, designers, marketing professionals, customer service representatives, writers, and more — all remote work positions. We posted thousands of jobs over the years we ran WWR. In spring 2017, we sold We Work Remotely to Metalab, to cut down on manual labor taken to run the board and focus more on our core business."}, {"context": "Sortfolio.com. In 2009, 37signals launched Sortfolio (previously named Haystack) to help clients find the right web designer in a more efficient way. Clients are able to filter by city and typical budget range and then peruse the results in a more visual way. We ended up selling Sortfolio in 2013 to be able to focus more on Basecamp and allow another company to give Sortfolio the love and attention it deserves."}, {"context": "Know Your Team (formerly Know Your Company). In 2013, 37signals created a software tool that allows managers to ask questions to gain insight into what their employees think about work, the culture, the direction of the company, what people are working on, or even something personal like their favorite recent movie. We created Know Your Team because when the 37signals team grew to about 30 people, Jason realized he didn’t know the company or its people as well as he should have. So, Know Your Team was created initially as an internal tool that eventually became a product that we sold to customers. In 2014, we sold Know Your Team to Claire Lew, and she’s been running it ever since!"}]}, {"title": "Titles for Ops", "paragraphs": [{"context": "We use the following criteria to assess the level and title of ops at Basecamp. These criteria aren’t exhaustive, and they aren’t mere checklists. The criteria outline the shape of what work at a given level on the Ops team at Basecamp looks like. It should also be noted that these criteria chiefly examine the scope of work someone is capable of tackling independently. In addition to that assessment, we also look at the consistency and quality of the execution itself. Basecamp pays in the top 10% of the industry (based on San Francisco rates), so the quality of the work itself should be commensurate with that target."}, {"context": "Junior Site Reliability Engineer. Discussion about tasks and how to complete them prior to starting work is required. Basic familiarity with networking, configuration management, containers, orchestration, and other major systems, and with common processes and procedures. Mostly carries out low-risk, isolated system maintenance tasks; passively participates in emergency problem resolution. Many questions to more senior team members."}, {"context": "Does not participate in on-call rotation. Self taught; may have worked at IT Help Desk for 1-2 years. Site Reliability Engineer. Work is reviewed with the occasional need for material direction or implementation changes. Works on single system / variable problems. Can handle on call with the backing of a more senior team member."}, {"context": "Can perform work on production systems by following existing procedures. Shows strength in some areas of specialization, but lacks the balance of experience in all areas. Lacks institutional knowledge about our systems. Not completely familiar with documentation or procedures. Usually at least 5 years of experience as sysadmin or programmer with site reliability experience."}, {"context": ". Senior Site Reliability Engineer. Work doesn’t necessarily need to be reviewed, but general approach may be. Can work independently on smaller projects and be a reliable contributor to larger projects. Fully participates in on call rotation. Subject matter expert in at least one major system. Plans and performs lower risk maintenance independently. Participates in higher risk maintenances."}, {"context": "Contributes to resolving major problems. Improves existing professional standards for the team. Usually at least 6-10 years of experience being a professional sysadmin or network engineer; typically 5 years experience at Basecamp internalizing how we work. Lead Site Reliability Engineer. Able to fill in and lead team for short periods. Work happens completely autonomously with no regular need for review."}, {"context": "Expert on multiple systems. Helps make strategic decisions around major components. Elevates the standards through new tooling, processes, procedures and effective communication. Able to carry out research, testing, implementation and improvement for new systems. Leads high risk maintenance with limited to no customer impact. Significant technical contributor to problem resolution; demonstrates consistent maturity in communication and demeanor under stress."}, {"context": "Performs more complex work like capacity planning, load testing, security improvements, etc. Sets new professional standards for the team. Usually at least 8-12 years of experience being a professional sysadmin. Principal Site Reliability Engineer. Can run large and complex Ops projects independently. Carries significant responsibility for many domains of infrastructure. Multiple areas of expertise: configuration management, containers, continuous integration / development, debugging, orchestration, optimization, networking, performance, reliability, security."}, {"context": "Makes what is new normal; what is old reliable; evangelizes what is next. Pushes the whole organization forward regularly through implementing new systems and designs. Writes new procedures and documentation regularly; trains others throughout the company. Work is almost always free of mistakes; often helps others improve the quality of their work."}, {"context": "Completely comfortable working with all teams at Basecamp; frequently coordinates work across teams to solve complex problems. When a site is down, something is broken, or work is crazy, this person is ready to save the day and lead us to a successful resolution. Effectively delegates work to others; acts as a leader who has earned the respect of their peers."}, {"context": "Capable of coordinating company wide response to major issues and leading problem resolution via emergency procedures. Usually 12-15 years of experience being a professional sysadmin."}]}, {"title": "State FMLA Laws", "paragraphs": [{"context": "New York. If you’re an eligible secondary caregiver in the state of New York, you may be able to take up to 10 weeks leave. Washington. This is a voluntary plan fully funded by 37signals. Employees will not be taxed for this plan. This plan is effective April 1, 2019, and in effect for no less than a year and continuously thereafter."}, {"context": "Current and future employees of 37signals LLC are eligible for this policy. The definition of Family member can be found in the WA state law RCW 50A.04.010. New child is defined as a new birth, adoption, or fostered minor. A “Primary Caregiver” is the person who provides the child with the majority of their care during Parental Leave. A"}, {"context": "“Secondary Caregiver” is a parent who is accompanied by the presence of the “Primary Caregiver”. In practice, one example of this policy would be one parent home full-time with a new child as a “Primary Caregiver” and the other parent home part-time as a “Secondary Caregiver”. If 70% of your pay is lower than what Washington State would pay under the state requirement, we will supplement to meet that requirement."}, {"context": "All durations allowed in this policy are on a 52 consecutive week period. Benefits are allowed per event and do not have a total annual cap. For example, one medical event in March would not reduce the benefit for a medical event in October provided they are unrelated and occurred separately."}, {"context": "An employee must be in employment for 820 hours during the qualifying period (“Qualifying period” means the first four of the last five completed calendar quarters or, if eligibility is not established, the last four completed calendar quarters immediately preceding the application for leave). The employee must also have worked at least 340 hours for the employer during the 12 months immediately preceding the date leave will commence. An employee that had coverage under the state plan retains the state plan coverage until the employee qualifies for coverage under the employer’s voluntary plan. If an employee was eligible to take benefits under the approved voluntary plan of a previous employer, that employee would be immediately eligible for benefits under the current employer’s voluntary plan."}, {"context": "In addition to the 12 weeks outlined in the companywide policy, as the the birthing parent you may take an additional 2 weeks of leave at $1,000 a week if pregnancy complications result in a longer recovery period. If one of your family members is under treatment or recovery for a serious medical condition and requires your care, you may take 4 weeks off at 100% pay. If after 4 weeks you need more time, you may take up to an additional 8 weeks at 70% of your pay for a total of 12 weeks."}, {"context": "A secondary caregiver in Washington State, on Family Leave may take an additional 6 weeks of Family Leave, at $1,000 per week for those 6 weeks. This is in addition to the Family Leave given to all employees regardless of their state of residence. Family and personal leave may be taken together for a total of up to 16 weeks. If you are the birthing parent and require additional time to recover, you may take an additional 2 weeks at $1,000 per week for a total of 18 weeks."}, {"context": "If one of your family members is in the military and you experience an exigency circumstance, 37signals has you covered. Exigency circumstances can include short-notice deployment, military events and related activities, childcare and school activities, counseling, and post- deployment activities. You may take 4 weeks off at 100% pay. If after 4 weeks you need more time, you may take up to an additional 8 weeks at 70% of your pay for a total of 12 weeks. Benefits will be calculated according to the Washington State policy — RCW 50A.04.020(4) and (5)."}, {"context": "37signals will continue to maintain your health insurance and your job at 37signals through the duration of your leave."}]}, {"title": "Where We Work", "paragraphs": [{"context": "From home. Most people at 37signals work from home most of the time. You can spend up to $2,000 during your first year at 37signals outfitting your home office. Getting the basics right will make a big difference: a good chair and a good desk. From coffee shops. Working from home all the time isn’t everyone’s cup of coffee. Lots of us choose to work from coffee shops or other third spaces either some of the time or a lot of the time. Great for a buzz of other people and caffeine, but please do mind our basic security rules and procedures to ensure that nothing leaks on to the cafe wifi."}, {"context": "From a coworking space. If working from home or from a coffee shop doesn’t suit you, then trying a coworking space might just do the trick. 37signals offers a $200/month stipend towards a desk in such a place. We also offer all staff an account with Deskpass if you need inspiration."}]}, {"title": "What We Stand For", "paragraphs": [{"context": "Values. Before anything else, values come first. Without clear, shared values, we wander independently and contradict one another. Everything’s harder when we all believe different things about what’s important to us, our company. Key values:. Be Straightforward. Whenever we speak — internally or externally — we should speak plainly and clearly. Watch out for lingo, assumptions, exaggeration, or other things that get in the way of a straightforward explanation. This doesn’t mean we strip the poetry and personal expression from our language, but it’s got to make sense. With the exception of deep technical discussions, anyone who reads what we collectively write should simply get it without further explanation required. Don’t use eight words when five will do."}, {"context": ". Be fair and do the right thing. What’s fair? What’s the right thing? We all have to use our best judgment, and everyone’s judgment varies, but a good rule of thumb is “what would you do for a friend or a neighbor if they asked for help?” An example might be providing a refund even if it’s a little outside the refund window. Or being someone who says “Sure we can do that for you” when a customer expected you to say “sorry, we can’t.” If the request is reasonable, grant it. At the same time, saying no is sometimes the right thing! If that’s the case, don’t feel badly about it."}, {"context": ". Levelheadedness. We should be calm, considered, and thoughtful in our dealings with each other and the world at large. We don’t act out of spite, we don’t rush to judgment, we don’t jump to conclusions. If someone disagrees with us or attacks us we listen, we think, and we respond calmly and clearly — directly addressing the idea or the situation, not the personality or the pressure."}, {"context": ". Generosity. Generosity is a wonderful virtue. Being generous is surprising someone on the other end with goodwill and asking for nothing in return. It could be time, attention, or treasure — we give what we’re expected to, and then some. Independence. This one’s a bit of a contradiction. After speaking about shared values, here’s one that breaks away: Independence. We encourage independent thought and original thinking. Since day one, we’ve always done things our way. We don’t look to the industry or our competitors for the way forward. We see things with our own eyes, make our own calls, and offer thoughts, perspectives, ideas, and products that we think are right, not that they think are right."}, {"context": ". Helping small businesses deal with growth. Growth happens. Growth makes a lot of things more difficult — people don’t know each other as well, information is harder to find, stuff gets lost, communication becomes muddled, it becomes harder to stay on top of everything that’s going on, etc. What worked for 3 or 5 people, doesn’t work as well at 6 or 8. And certainly not 10, 15, 25 or more."}, {"context": "At some point, growing small businesses need a system, something to stay organized, something to grow with so they don’t lose control of themselves along the way. Company-wide communication, team-based communication, and project work needs a home. Most companies cobble together a latticework of separate tools as they grow, but the weight of disorganization and lack of order collapses and eventually catches up to them. Email doesn’t cut it anymore. More meetings aren’t going to solve the problem. And increasingly, incessant chatting creates exponentially more communication without the necessary structure and context to make it useful."}, {"context": "This is where Basecamp comes in. Basecamp helps growing companies organize their projects, internal communications, and client work in one place so they have a central source of truth. People know what to do, they know where things are, it’s clear where things stand, and everyone is accountable. This is what we do here. It takes many forms, and we’re always working towards a more perfect system, but we help groups of people get their shit together — and keep it together — so they can do their best work with their team, in their company, for their own customers."}]}, {"title": "How We Work", "paragraphs": [{"context": "Cycles. We work in 6-week or 8-week cycles at 37signals. There are typically six cycles to a year. Two are 8-week cycles, during Summer Hours, and the rest 6-week cycles. This fixed cadence serves to give us an internal sense of urgency, work as a scope hammer to keep projects from ballooning, and provide a regular interval to decide what we’re working on."}, {"context": "The idea is not that everything we ever decide to work on has to take six or eight weeks or can be completed in that time. But rather that we think about how we can break big projects into smaller ones that can be done in that amount of time, and that we bundle smaller things into a presentable scope of work that can be discussed."}, {"context": "This is particularly important for the product teams. Here we like to designate the work we take on with the scope in mind up front. We think of a small feature as a 1-weeker or a big feature as a 6-weeker (or anything in between). This designation helps us avoid a 1-weeker snowballing into a 4-weeker, just because people keep piling on more scope. Work is thus limited by a budget, and the budget focuses our discussion about what’s reasonable and what’s not. When a project starts slipping on its budget, the first approach should be to judo the problem and scope hammer the domain — and certainly not make it up by working more hours! Most things we work on can fit within six normal weeks or eight summer weeks."}, {"context": "Cooldown. In between each cycle, we spend two weeks cooling down. That’s the time to deal with bugs or smaller issues that come up, write up what we worked on, and figure out what we should tackle next. It’s sometimes tempting to simply extend the cycles into the cooldown period to fit in more work. But the goal is to resist this temptation. Yes, sometimes a little spill-over will happen, but it’s helpful to think about the end of the normal cycle as “pencils down”. That means that by week 4 of a normal cycle, we should be winding down, getting ready to launch, make sure QA is lined up, and all the other work that happens during and after the launch of new projects."}, {"context": "Communication. It’s hard to keep up on what everyone is doing and what it means, if you just watch the stream of latest activity scrolling along in 37signals. (It’s also a waste of time and source of stress to even try.) Instead, we have four chief mechanisms for keeping everyone in the loop about the work that’s going on."}, {"context": "First, there’s the daily question of What did you work on today?, which supplies the nitty gritty details, but as a personal narrative. They’re a great conversation starter if you see someone working on something you either care about or want to learn more about. Please do use them as such! You’re obliged to answer this question at least twice a week."}, {"context": "Second, there’s the weekly question of What will you be working on this week?, which details your intentions for the coming week. Everyone except team OMG is obliged to answer this question when they’re not out. Daily and weekly check-ins are subdivided by department so you're only subscribed to your team's answers. You're of course free to subscribe to other team check-ins, but you're not obligated to do so if you find it too noisy."}, {"context": "Third, there are the heartbeats. These are the team versions of What did you work on this cycle? This is where we summarize and celebrate the work that’s been done. Every team lead is obliged to write, or designate someone on the team to write, this account one week after a cycle has ended."}, {"context": "Fourth, and finally, there are the kickoffs. These are the team version of What are you going to work on next cycle? This is where the plan for the coming six or eight weeks is presented. Every team lead is obliged to write, or designate someone on the team to write, this account before the start of the new cycle. "}, {"context": "These mechanisms work together to free individuals and teams to run their days and cycles with confidence and independence. We have six opportunities per year to make big decisions about what to work on, and the rest of the time should chiefly be spent carrying out those short-term plans. By having clear expectations for communication, it’s easier for everyone to build trust in where we’re going and why."}, {"context": "All these questions and write-ups will be posted in the What Works project for the current year. Pitches. Whether you work on the product development or not, your voice and observations can help determine what we should be working on. The way to exert this influence is through pitches. Write-up your idea of a new feature, a change to a feature, or any other product development you think we should be considering as a fully considered post (the more specific, the better). This gives the whole company a chance to consider and respond to the idea, and then we’ll have the idea encapsulated in a post, available for reference at any time."}, {"context": "There’ll always be more pitches than we have time to field, though. So it’s important to have realistic expectations about what will happen after you posted your pitch. The default is simply that everyone involved with product development (and probably most everyone else in the company) will read and consider your pitch. That’s a win right there. Even if the full pitch doesn’t make it in, it can impact other product decisions by shining light on a weak point."}, {"context": "While a few pitches might instantly strike a chord loud enough to go on the plate for the next cycle, it’s more likely that your pitch will sit for a while first. There are always more ideas than time, and we can only get a few things done each cycle. So chances are that even if everyone agrees the pitch is a great idea, it might not be the next most important thing for us to tackle. Don’t be discouraged by this. We’ve had many pitches that have sat for many cycles, if not years, before finally coming together and then happening."}, {"context": "Asynchronously. We have people working all sorts of different hours and from all sorts of different places at 37signals. That alone makes it hard to enforce a lot of tightly-coupled workflows during the day, but that’s a feature not a bug. Most of the work you do at 37signals shouldn’t require you to be in constant communication throughout the entire day with someone."}, {"context": "It’s far better for everyone’s concentration and sanity if you collaborate as though most things will get an answer eventually, but not necessarily right this second. Your first choice of action should be to post a message, a todo, or a document about what you need to explain or need to know. Then others can read it on their schedule, when the natural lulls of the day allow it, rather than being interrupted right in their peak flow time."}, {"context": "Don’t take that as gospel, though. Some times you really DO need to tightly collaborate with someone for an extended period of time, and that’s fine. We have pings, hangouts, screensharing, or even in-person collaboration for when nothing else will do. (But most of the time something else will). All that being said, you should still ensure that there is ample overlap with the people you work with most of the time. While most roadblocks can just as well be cleared in 15-30-60 minutes, they become real annoying if it’s a one-day turn-around every time."}, {"context": "In certain departments, like Support and Ops, it’s even more important that people are dependently available when they say they will be. That work has a lot of interrupt-based jobs that simply needs to be done right here, right now. So what applies to almost all work for design and programming and QA may well apply a little less frequently there."}, {"context": "In self-sufficient, independent teams. Organizational theory is thick with descriptions of the trade-offs between functional and project company structures. We seek to be more project than functional. This means a single project team should be able to go from idea to deploy as independently as possible. Thus, the fewer other departments a team has to pass through on their road to rolling out a new feature, the better. We should be working on opening all these natural road blocks that form by default when you have awesome, strong departments, such as SIP, mobile, Ops, QA, and so forth."}, {"context": "For example, a team working on a new scheduling feature should be able to test and integrate their work with the native apps without involving mobile, unless something special is needed. Mobile shouldn’t need a special heads up, and thus interruption and mental overhead or even guilt from lack of participation."}, {"context": "Similarly, a native feature that requires an API change should be carried out by that native team directly. When we need to use the staging database, that should be self-service too. Have a script anyone can run to restore it. Don’t require going to ops and waiting around for someone to do it for us."}, {"context": "None of this means we can’t talk together or ask colleagues with more experience or expertise for their advice. It just means it shouldn’t be a required, necessary step to make 37signals better. As soon as organizational bottlenecks form, like a slew of features waiting for “the mobile integration”, we’re dragged towards more micro and detailed schedule management. It becomes a critical path with dependencies and making sure team Z is available just at the right moment for team A, such that nobody is blocked. That’s a poor fit for our organizational aspirations, so we have to work to counter that."}, {"context": "With managers of one. We rely on everyone at 37signals to do a lot of self-management. People who do this well qualify as managers of one, and we strive for everyone senior or above to embody this principle fully. That means setting your own direction when one isn’t given. Determining what needs to be done, and doing it, without waiting for someone to tell you to. A manager of one will spend their time well when left to their own devices. There’s always more work to be done, always more initiatives to kick off, always more improvement to be had."}, {"context": "Balanced. We limit ourselves to a 40-hour (32-hour in the summer) work week. Keeping our hours at work limited forces us to prioritize the work that really matters. A healthy amount of sleep and a rich and rewarding life outside of work should not be squandered for a few more hours at work."}, {"context": "There are occasions where teams or individuals need to work off-hours for on-call, maintenance or emergencies. This time should not be in addition to your normal working hours. Use your discretion to take time off to make up for the additional hours you put in during the week."}]}, {"title": "Titles for Data Analysts", "paragraphs": [{"context": "We use the following criteria to assess the level and title of our data analysts at Basecamp. These criteria aren’t exhaustive, and they aren’t mere checklists. They’re a guidance to having an individualized discussion about career progression. General job description. Analyzes complex business problems and issues using data from internal and external sources to provide insight to decision-makers."}, {"context": "Identifies and interprets trends and patterns in datasets to locate influences. Constructs forecasts, recommendations and strategic/tactical plans based on business data and market knowledge. Creates specifications for reports and analysis based on business needs and required or available data elements. May provide consultation to users and lead cross-functional teams to address business issues."}, {"context": "May directly produce datasets and reports for analysis using system reporting tools. Level specific traits. Senior Data Analyst (L3). Work doesn’t necessarily need to be reviewed, but general approach may be. Comfortable operating as a manager of one, self-directing scope of work and setting timelines independently. Can provide informed advice to other teams on how best to approach data-related problems."}, {"context": "Usually at least 5 years of experience. Lead Data Analyst (L4). Work happens autonomously with no regular need for unsolicited review. Brings in appropriate stakeholders for input and feedback on a timeline that makes sense for all involved. Advocates for impactful projects that require cross-team collaboration. Able to run and direct small self-organized teams for such projects."}, {"context": "Leads in making decisions on when and how substantial changes to the data analytics tooling and workflow are needed. Turns implicit knowledge explicit by documenting processes, key decisions, schematics, and other facts regularly. Makes data more accessible across the company by publishing relevant analyses and training others throughout the company on how to access data unaided."}, {"context": "Helps set and maintain professional standards for the entire organization. Is highly regarded by others in the company and works to make the company better as a place to work. Usually at least 8 years of experience. Principal Data Analyst (L5). Can set and direct a large, cross-department project team towards one goal. Capable of running and directing those teams for substantive long-term projects."}, {"context": "Pushes the whole organization forward regularly through the use of different organizational concepts and analytical applications. Regularly publishes and shares analysis process insights inside and outside the company. Capable of designing and architecting new data analytics tooling and workflows. Usually at least 12 years of experience."}]}, {"title": "Titles for Programmers", "paragraphs": [{"context": "We use the following criteria to assess the level and title of programmers of Basecamp. These criteria aren’t exhaustive, and they aren’t mere checklists. They’re a guidance to having an individualized discussion about career progression. It should also be noted that these criteria chiefly examine the scope of work someone is capable of tackling independently. In addition to that assessment, we also look at the quality of the execution itself. Basecamp pays in the top 10% of the industry (based on San Francisco rates), so the quality of the work itself should be commensurate with that target."}, {"context": "Junior Programmer. Work is thoroughly reviewed with substantial back’n’forth frequently needed before merging. Basic language features are mastered, but some advanced structures may still be unfamiliar. Occasional issues following patterns and approaches within existing code bases. Works primarily on tightly scoped, routine problems. Usually less than 2 years of experience being a professional programmer in the specific domain."}, {"context": ". Programmer. Work is reviewed with the occasional need for material direction or implementation changes. Follows established patterns and approaches within existing code bases with ease. Works mostly on clearly defined and scoped individual features or problems. Usually at least 2-5 years of experience being a professional programmer in the specific domain."}, {"context": ". Senior Programmer. Work doesn’t necessarily need to be reviewed, but general approach may be. Fully capable of taking substantial features from concept to shipping as the sole programmer (alongside a designer). Can provide material feedback on the work of junior programmers and programmers. Deep expertise within at least one programming environment."}, {"context": "Basic proficiency in at least one additional programming environment. Usually at least 5-8 years of experience being a professional programmer in the specific domain. Lead Programmer. Work happens completely autonomously with no regular need for review. Fully capable of owning and running entire subsystems of work (Queenbee expert, Action Cable implementation)."}, {"context": "Helps set and maintain professional standards for the entire organization. Deep, substantial expertise in multiple programming environments. Capable of running and directing small teams for substantial projects. Capable of executing projects across multiple domains (say, native app that needs API backend). Usually at least 8-12 years of experience being a professional programmer in the specific domain."}, {"context": ". Principal Programmer. Can set and direct an entire department, like SIP, Core Product, or Research & Fidelity. Fully capable of designing, owning, and running entirely new, novel systems (design billing systems, Trix, Active Record from scratch). Capable of running and directing larger teams for large, long-running projects. Recognized widely in the industry for material contributions to the state of the art."}, {"context": "Invents new concepts, pushes the whole organization forward regularly. Usually at least 12-15+ years of experience being a professional programmer in the specific domain."}]}, {"title": "37signals Code of Conduct", "paragraphs": [{"context": "37signals pledges to be a company with a healthy and friendly work environment. What follows is a set of guidelines on how we get there. Behavior that contributes to a healthy and friendly work environment:. Using courteous language. Being respectful and empathetic, especially when it comes to differing viewpoints and experiences."}, {"context": "Gracefully accepting constructive criticism and direct feedback, as well as offering it in that spirit. Assuming good intentions. Approaching work relationships with a default of trust and positivity. Unacceptable behavior:. The use of any sexualized language or imagery. The use of any violent language or imagery. Making unwelcome sexual advances or giving unwanted sexual attention."}, {"context": "Any form of discrimination and harassment. Particularly on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, age, disability, marital status, citizenship, national origin, genetic information, or any other characteristic protected by law. These expectations apply to all current employees. Unacceptable employee conduct will not be tolerated virtually (e.g. in Basecamp, GitHub) or at in-person events."}, {"context": "Reporting. If you experience or witness something that violates our Code of Conduct, please report it to your manager or to leadership via email or chat. All reports will be reviewed and investigated, and your confidentiality will be as protected as possible during the investigation. If an employee is found to have violated our Code of Conduct, it will be permanently documented in their personnel file. Depending on the severity of the offense and the findings of the investigation, additional responses may include mandatory training, a formal reprimand, or even termination. The reactive measures taken will be shared with the reporting employee when possible."}, {"context": "In extreme circumstances, you can report an incident anonymously. Anonymous complaints should be reserved for incidents in which you fear for your safety. An important note: Most interpersonal conflicts do not rise to the level of a Code of Conduct report. If you find a colleague rude or difficult to work with, you should address that with your manager or better yet with that colleague directly. Code of Conduct reports are reserved for the kind of unacceptable behavior outlined above and other serious transgressions — illegal or egregiously unethical behavior."}, {"context": "Some Definitions & Resources. Discrimination. Harassment. Sexual Harassment. Retaliation. The 37signals Code of Conduct is not meant to be a replacement for your EEO rights. You can pursue charges through 37signals channels and through EEOC channels simultaneously. Visit the EEOC website for more information about your employee rights."}]}, {"title": "Performance Improvement Plan Process", "paragraphs": [{"context": "If your work performance is not meeting expectations, you may be put on a Performance Improvement Plan (PIP). We only initiate PIPs if your manager’s concern is correctable in the short term. We do not usually initiate PIPs for fundamental performance issues that relate to your core job skills. Below are the steps your manager will take at 37signals when they identify a problem with your performance that must be addressed with a performance improvement plan (PIP)."}, {"context": "Identify and Document. Your manager will identify a productivity or disciplinary problem as soon as possible after it occurs if it’s a specific incident, or as soon as they can when they sense a general problem with your ongoing performance. Your formal reviews may be helpful in identifying a problem, but managers shouldn’t wait for those reviews to raise a problem with you."}, {"context": "Your manager will have a conversation with you about:. the specific problem. the steps required for you to correct. the timeline for correction. Revisit Throughout Timeline & On Deadline. Your timeline for taking steps to correct your performance is at the discretion of your manager. During that timeframe, you and your manager will check in periodically about whether or not they’re seeing the improvement they’ve asked to see."}, {"context": "When you come to the end of your PIP timeline, you and your manager will have a formal check-in. If your performance is back where it should be, that’s the end of this process. If your performance is not where it should be, your manager will outline next steps. If they feel you’re putting forth good effort and could use more time to show improvement, they may extend the timeline of the PIP. If your manager feels your performance has not improved at all and you haven’t met the requirements outlined in your PIP, they may decide to terminate your employment with 37signals."}, {"context": "If you are terminated, you’ll be offered a severance package that includes 2 weeks of pay for every 6 months of employment, with a max 6 months severance pay (for 6 years+ of employment). The package also includes health insurance for you and your dependents if you’ve been on our policies for the same time periods, compensation for unused vacation time, and compensation for unused sabbatical time if applicable (1 year look back). In return, you’ll be asked for a general release of liabilities and other standard employment termination terms. When you begin looking for work, your manager and the company may provide references, if desired."}, {"context": "What’s the most important detail missing from the above process?. Support. Your manager will offer extra support during the PIP process. We know lots of external factors can come into play at work. If you’re having personal or professional issues that are harming your performance, please tell your manager so they can work with you."}, {"context": "Lots of employees who still work at 37signals have been on PIPs. We’re not in the game of high turnover. We want to see you through the process and see you come out energized on the other side. We care about everyone who works here and if you’re having performance issues, our first reaction is to help you. We only ask that you work with us to devise a realistic improvement plan that elevates you and works for 37signals."}, {"context": "Exceptions. The process outlined above is for employees who are dealing with manageable performance or disciplinary issues. If an employee is negligent in their duties or commits fraud or insubordination to the point that a performance plan won’t serve 37signals or the employee, we retain the right to immediately terminate at-will as stated in our employment contracts. 37signals also retains the right to bypass steps outlined above, including offering a severance package, if the severity of performance problems warrants that. In either of these cases, the reasoning will be spelled out in detail to the employee prior to termination."}]}, {"title": "Titles for Support", "paragraphs": [{"context": "We use the following criteria to assess the level and title of our Support team members at Basecamp. Junior Customer Support Representative, level 1. Throughput and productivity is uneven/unpredictable. Adept at commonly asked questions and inquiries. Uses HelpScout effectively. Prefers email support over phone, as is not yet comfortable speaking adlib about product."}, {"context": "Works on routine emails or calls. Sometimes assigns emails to others versus finding the answers themselves, is new to Basecamp’s products. less than 2 yrs support experience. Customer Support Representative, level 2. Work beyond customer support emails is reviewed with a frequent need for material direction or implementation changes. Guidance is often required. Understands when to initiate on-call workflow with guidance from peers."}, {"context": "Throughput and productivity is predictable. Is able to adhere to our customer service values a majority of the time. Is adept at working with HelpScout and finds productivity shortcuts. Works evenly on calls and email, is able to field inquiries that are multi-faceted. Understands most, if not all, of the product features and can provide support on all mobile platforms."}, {"context": "Teaches classes and/or contributes to the knowledge database, works with software developers and others in the company to resolve issues. Pattern recognition regarding problem areas in app is developing. Begins to recommend new features and enhancements. Usually at least 2-5 years of experience being a customer support professional. Senior Customer Support Representative, level 3"}, {"context": ". Work beyond customer support tickets is self-directed and doesn’t necessarily need to be reviewed, occasionally needs help with choosing items that are impactful. Understands when to initiate on-call workflow without guidance from peers. Complete and deep expertise with all versions of Basecamp. Can handle any inquiry. Has predictable and high throughput, exceeds CS values, while also maintaining a high level of customer satisfaction. Generates new ideas and systems in order to deliver better customer support. Is creative and customer-centric. Works independently."}, {"context": "Can provide material feedback on the work of Level 1-2 customer support and still maintain productivity. Can work very effectively with difficult or upset customers. Initiates training, publishes to SvN is seen as a leader, “go-to” person on the team. Tests on multiple platforms and reporting findings as Advanced Troubleshooting/Quality Documentation while maintaining regular customer conversations."}, {"context": "Can single-handedly handle a crisis either by taking control over reporting and channels, or delegating tasks to others. Pattern recognition fully developed in order to contribute significantly to product features/enhancements. Usually at least 5-8 years of experience being a customer support professional. Lead Customer Support Representative, level 4. Work happens completely autonomously with no regular need for review."}, {"context": "Understands when to initiate on-call workflow without guidance from peers. Uses console access to resolve cases that require pre-written scripts or other basic code touches to fix common issues. Tier 2/UX skills developing:. Has console experience, including bug investigation via On Call work while maintaining regular customer conversations. AND/OR. Demonstrates product dedication via User Experience work while maintaining regular customer conversations."}, {"context": "Demonstrates product dedication via testing on multiple platforms and reporting findings as Advanced Troubleshooting/Quality Documentation while maintaining regular customer conversations. Fully capable of owning and resolving any type of ticket. Clearly articulates new issues for software development engineers, suggests changes to website. Authors help desk, contributes original content to knowledge base. Designs new programs that have high customer impact."}, {"context": "Helps set and maintain professional standards for the entire organization. Is highly regarded and respected by others on the team. Deep, substantial expertise in multiple environments (all versions of Basecamp, other products, our apps, security, sign on, email logs, Dash and trollcop, sign on, trace routes, network issues, desktop issues — Macs, PCs and a variety of handhelds, etc.)"}, {"context": "Capable of running and directing small teams for substantial projects. Expert within technology beyond Basecamp, like browsers, both OS. Is good at getting to root causes of issues and then writing them up in a way that can be acted upon by software development. Consulted by developers and designers for input."}, {"context": "Pattern recognition fully developed in order to pitch new product features/enhancements. Usually at least 8-12 years of experience being a customer support professional. Principal Customer Support Representative, level 5. Work happens completely autonomously with no regular need for review. Uses console access to resolve cases that require pre-written scripts or other basic code touches to fix common issues."}, {"context": "Tier 2/UX skills developed:. Trains others on console and performs significant amount of On Call work while maintaining regular customer conversations. OR. Demonstrates significant product expertise via User Experience work while maintaining regular customer conversations. Can introduce others/train others in this pathway. Demonstrates significant product expertise via testing on multiple platforms and reporting findings as Advanced Troubleshooting/Quality Documentation while maintaining regular customer conversations. Can introduce others/train others in this pathway."}, {"context": "Expert within technology beyond Basecamp, like browsers, both OS, and many third-party API extensions. Excels at getting to root causes of issues and then writing them up in a way that can be acted upon by software development. Does not necessarily need help from developers, marketing, or design for input."}, {"context": "Authors help desk, contributes original content to knowledge base. Designs new programs that have high customer impact. Writes new classes and delegates/trains others on them. Helps set and maintain professional standards for the entire organization. Is highly regarded and respected by others on the team. Conceives of, writes, and trains others on new policies."}, {"context": "Deep, substantial expertise in multiple environments (all versions of Basecamp, other products, our apps, security, sign on, email logs, Dash and trollcop, sign on, trace routes, network issues, desktop issues — Macs, PCs and a variety of handhelds, etc.). Runs and directs small teams for substantial projects. Can delegate without pause, yet leads by following. Understands expertise of each programmer, designer, and site reliability engineer in order to expediently consult and problem-solve. Pattern recognition fully developed in order to pitch new product features/enhancements. Helps find budgetable time and resources to get a problem solved; offers to help code/design initial first drafts in part of pitch."}, {"context": "Usually at least 12-16 years of experience being a customer support professional."}]}, {"title": "Vocabulary", "paragraphs": [{"context": "37signals has over time developed a vocabulary specific to our work and company. Chowder. When establishing the tasks under a project, there are must-haves and maybes. Chowder is a shorthand we use to refer to the maybes. Judo. Most problems can be solved in a thousand different ways. One way might take 100 hours, another might take 10. Judo is the art of problem restatement. Turning that massive, scary 3-month looking problem into one that can be done in 3 weeks instead. It’s often used when we get frustrated trying to solve something hard and we aren’t making sufficient progress: “Let’s figure out a way to judo this!”."}, {"context": "PDI. “Please do investigate”. Seen most often on to-do lists in Basecamp to indicate uncertainty. It helps everyone on the project understand that we’re going to look into it but it may or may not be feasible, practical, or possible. Scope Hammering. It’s a rare case when our initial aspirations for a feature don’t meet the boundaries of our cycle budgets. When that happens, our go-to tool for shipping is scope hammering. This basically just means shrinking the scope, removing features or configuration or fidelity, until the work is doable within the time left. It’s the opposite tactic to working longer days or weekends or to postpone the project into another cycle. Almost every project can be scope hammered, especially if you invite someone in to assist with the analysis who isn’t afraid to kill other people’s darlings. You’ll get better at doing that yourself after a few rounds too."}]}, {"title": "Frequently Asked Questions", "paragraphs": [{"context": "Where should I report a bug?. We are actively fixing feature-related bugs for Basecamp and HEY. It’s a good idea to try to do a quick search first to see if your bug has already been reported, but better to report something twice than not at all. If you find a bug related to Basecamp, add it to a Card Table in Basecamp Web: Bugs, Basecamp Android: Bugs, or Basecamp iOS: Bugs."}, {"context": ". If you find a bug related to HEY, add it to a Card Table in HEY Web: Bugs, HEY Android: Bugs, or HEY iOS: Bugs. We do fix any security or privacy related bugs for all products, including our legacy products. If you think you’ve found one, flag to SIP by mentioning them in the relevant HelpScout case (if applicable) or raising in their Campfire."}]}, {"title": "International Travel Guide", "paragraphs": [{"context": "If you travel out of your country of residence with your work laptop or other devices, you may face questions about business visitor visas, customs, and border security. We have answers!. When you travel for 37signals business, here’s what you need:. Your passport! Apply for one now if you don’t have one already. Renew now if your passport expires in the next six months."}, {"context": "A travel visa, waiver, or an electronic travel authorization. 37signals will cover the cost of any documentation you need to travel on 37signals business. An invitation letter that substantiates the purpose of your travel. Your lodging address and contact info. A security checklist for your laptop and phone. Clearing work data from your devices is required before crossing any border."}, {"context": ". Travel to the United States. Visa. You need a visa or a waiver to authorize travel to the US. If your country participates in the Visa Waiver Program (VWP), then you can apply for an ESTA (Electronic System for Travel Authorization) within 3 days of travel. The ESTA is valid for 2 years. Apply for an ESTA here."}, {"context": "Canadian passport holders don’t need a visa to enter the US for non-paid business events. Passport and government ID are all that’s required. B-1 Business Visitor Visa. If your country does not participate in the Visa Waiver Program or you are not eligible for an ESTA, you’ll need to apply for a B-1 business visitor visa… the long way."}, {"context": "We’ll work with you through this process. Start early, as soon as we have dates for a meetup or conference. Visa appointments and processing can take weeks to months. Ping Andrea as soon as you know that you’ll need a visa. Trusted Traveler Programs. Citizens of some countries are eligible for Global Entry and Canadians are eligible for NEXUS. These programs are completely optional but may make life a little easier, at the cost of onerous biometric scans like fingerprinting (for Global Entry and NEXUS) and iris scanning (for NEXUS). Note: An ESTA is still required for travel; these programs just speed up entry."}, {"context": "Travel to countries other than the United States. Visa. The visa requirements for your nationality will vary depending on the country you plan to visit, as individual visa policies and requirements vary for different foreign citizens. It may or may not be necessary to obtain a travel document to visit your country of destination."}, {"context": "Please check the requirements for your nationality with your destination country as far in advance of travel as you can. You can also use a visa checker. You may be able to travel visa-free, or you may need to obtain a visa, a waiver, or an electronic travel authorization. Invitation Letter"}, {"context": "To substantiate the purpose of your travel to any country, we can provide an unofficial invitation letter that states that you’re traveling on behalf of 37signals business. Verify in advance if the country you’re visiting requires a letter of purpose, and that you won’t need a work visa to accompany a letter."}, {"context": "Company Security at Border Crossings. When you cross a border, you may be asked to unlock your phone or laptop for search, possibly exposing sensitive company data like source code, passwords, and customer account data. Yikes! We need to take some precautionary measures to safeguard our data. What’s a work device? Anything you have company data on: your laptop where you work with source code; your tablet where you read work email; your phone where you use the Basecamp app; etc."}, {"context": "TL;DR: Don’t Travel With Work Data. If you don’t need your work laptop (or tablet/phone), don’t bring it with you!. Wipe company data from your phone before crossing the border. Restore it afterward. Checklist: Before You Travel. Let us know! Share your travel plans and when you expect to arrive in the US."}, {"context": "Update your electronic travel authorization with your travel info when you have it. Ensure you have your passport, visa/waiver, invitation letter, and travel details all in order. If you run into general travel issues while on 37signals business, contact Andrea. If you find yourself facing serious consequences like arrest or illegal detention in the United States, you can contact our attorney Jennifer Schaaf. Her contact information is in the teams vault in 1Password. You should also contact your home country’s embassy or consulate; please save that phone number prior to travel."}, {"context": "If you’re traveling to a country with privacy laws that concern you, please raise that concern internally with Andrea before you travel so we can discuss putting protections in place, including connecting you with a local, on-call attorney. 1Password. Check that your personal 1Password vault doesn’t have any work logins. If it does, move them to the team vault instead. You have a personal vault inside the 37signals team which is perfect for those logins."}, {"context": "Turn on Travel Mode. Go to https://basecamp.1password.com/profile and click Enable Travel Mode. Open 1Password on each device you’re traveling with (laptop, phone, iPad, etc) so it can wipe its data while it’s in Travel Mode. HEY. Log out of HEY on all sessions. Clear browser cookies, logging you out of all work sites."}, {"context": "Laptops: Clear cookies in Chrome, Safari, etc. iOS: Settings > Safari > Clear History and Website Data. Android: Chrome > Settings > Privacy > Clear browsing data. Check Cookies and site data; uncheck all the other items. > Clear data. Source code. Make an encrypted archive on an external hard drive of your git repos so you can download and restore it after you’re through customs. Here are instructions for doing that if you’re running a Mac OS. Please perform an equally secure file encryption for Windows or Linux OS & check with SIP if you’re unsure how to do that."}, {"context": "Delete all source code from your laptop. Other sensitive documents. Same deal as source code. Make an encrypted backup on your external drive and remove from your laptop. Please refrain from using iCloud for any files/repos. Dropbox. Log out of Dropbox and disconnect. Touch ID (optional). Unlocking your device can be compelled at US border crossings, but other countries may be less intrusive, so it may make sense to make your device a little harder to unlock."}, {"context": "Disable Touch ID or Face ID on your phone, tablet, and laptop. Require a passcode/password to unlock. Checklist: At Customs. Have ready your passport, visa/waiver, invitation letter, and travel details including the address of where you’ll be staying. Ensure your devices are charged up and turned on. Customs may balk at a bricked phone or laptop."}, {"context": "Common questions:. Purpose of your visit? Here for a business meeting in city. Here to do work? Nope! Here on business, meeting with 37signals. Where are you staying? Lodging name, address, phone number. Be straightforward and truthful. You’re legit! No need to be cagey or misleading. Checklist: When You Arrive. Let us know when you’ve arrived at your destination and have cleared airport security."}, {"context": "Touch ID / Face ID: Reenable on your phone, tablet, and laptop. Dropbox: Log in and reconnect, but only if needed during travel. Basecamp app: Reinstall on your phone, tablet, and laptop. 1Password: Turn off Travel Mode. Go to https://basecamp.1password.com/profile and click Disable Travel Mode. Next time you open 1Password, you’ll have full access again."}, {"context": "HEY: Log back in on your device(s). Source code: Download and restore the archive of your git repos, but only if needed during travel. Other sensitive documents: Download and restore, but only if needed during travel. Checklist: When You Return. Same as when you travel! Repeat the checklists for any border crossing, whether into or out of the US."}, {"context": ". Any Questions?. Hitting a snag or have any questions? Ping Jeremy or Andrea and we can help."}]}, {"title": "What Influenced Us", "paragraphs": [{"context": "If you want to learn the 37signals view of the world, it helps to know the influences that helped form it. We've been around since 1999. Since then there’s been a number of key influencers that have marked the company culture. Books. Turn The Ship Around: “Leadership should mean giving control rather than taking control and creating leaders rather than forging followers”, David Marquet. 37signals employs great people and they deserve the freedom and autonomy to act on their own. Don’t wait for permission, just state what you’re going to do, and then do it."}, {"context": "Finding Flow: True happiness is found in optimal moments of engagement when we stretch just beyond our abilities and lose track of time and space in the process. Protecting the flow by limiting interruptions has been a driving principle of 37signals. Punished by Rewards: We don’t strive for trophies, swoon for trinkets, gameify our apps with badges, or push any other form of extrinsic motivation for neither ourselves nor our customers. Working at 37signals should be about the intrinsic motivation of doing a good job, not because you’re trying to impress someone else."}, {"context": "The Manual: “Do not wish that all things will go well with you, but that you will go well with all things”. Core lessons on keeping calm and carrying on that have inspired and guided us. Maverick: Ricardo Semler helped us find the confidence to promote and push for weird and different ways of working by showing just how weird and different you can work at even a place as stodgy as a 8,000-person industrial company in Brazil."}, {"context": ". People. Kent Beck. Martin Fowler. Kathy Sierra. Christopher Alexander. Bob Moesta"}]}, {"title": "Read on basecamp.com", "paragraphs": [{"context": "37signals Employee Handbook. For over 10 years, we didn’t have a handbook. In those 10 years, when a new person joined the company, they were expected to figure things out for themselves. But when we grew from a company of 10, 20, 30 employees to now a company of over 80, our “introduction by immersion” style stopped working. New hires felt lost and isolated, and their first weeks or even months on the job were stressful because of it. It can be unnerving to join any company, but perhaps 37signals in particular, given how different some of our practices are. There’s as much to unlearn as there is to learn. Prior to this handbook, navigating that path was both somewhat random and almost entirely oral. For a company that prides itself on clarity and writing, that just wasn’t right."}, {"context": "So, this is where we’ll try to share what’s worth knowing about 37signals the company, our culture, our process, and our history. It’s a guide to understanding what people are talking about when they call for “judo” (redefining a hard problem into an easy one) or whether it’s okay to take your vacation when you’ve only been with us for a month (yes)."}, {"context": "This handbook also offers us an opportunity to clarify who we actually are as a company. What do we stand for? How should we work? Codifying those beliefs into a handbook makes them tangible and, most importantly, editable. Making the company our best product is a guiding principle, but we can’t easily improve what we haven’t articulated. So whatever version of this handbook you’re reading, you can be sure it’s not the last. Please do help keep it up to date! And by up to date, we’re not just talking about misspellings and team changes. It’s just as much “we say we’re about X, but what we’re really doing is Y”. So many of these employee handbook projects turn out to be ideal-case prescriptions rather than real-world descriptions. They cover all the ways people should act, not the ways they actually do. That’s a sham. Let’s not write a handbook like that. Let’s keep it honest."}, {"context": "If you’re reading this just after joining the company, it’s particularly on you, actually. It’s harder for us slowly-boiled frogs who’ve been with 37signals for a while to spot the broken ways. Please take advantage of that glorious, shiny ignorance of being new, and question things. Sections. 37signals Is You. What We Stand For"}, {"context": "What Influenced Us. Vocabulary. Product Histories. Where We Work. Benefits & Perks. Getting Started. How We Work. Our Rituals. Making a Career. Our Internal Systems. A Note About Moonlighting. International Travel Guide. FAQ"}]}, {"title": "A Note About Moonlighting", "paragraphs": [{"context": "Moonlighting means working other professional, paid jobs outside of your work at 37signals. It’s not a black and white topic. There are one-time gigs, other pursuits, or opportunities that help you grow and make life interesting. We want to support that. But we want to make sure professional endeavors outside of 37signals don’t create conflicts of interest or affect your time, dedication, or performance at 37signals. So it’s a delicate balance."}, {"context": "With that in mind, here are some examples of what we’d consider OK and what we would consider a conflict of interest and not OK:. OK. An occasional side gig, free or paid, for someone you know. For example, if you want to work on a friend’s website, or a design or writing project for something you’re involved with, that’s fine."}, {"context": ". An occasional speaking gig, free or paid. Someone’s going to pay you to give a talk somewhere? That’s fine as long as it doesn’t involve multiple days off for travel (unless you use your own personal vacation time against this travel time). A side business that’s different from your day job, as long as the commitment is only a few hours a week. If you come to work exhausted because you’re trying to start a full-time business on the side, it’s going to impact your performance here."}, {"context": ". Serve as an advisor for another company, or be on a board, as long as there’s no conflict of interest. The time commitment must be under a few hours a month. And if there’s a scheduling conflict, 37signals gets priority. Do volunteer or occasional pro-bono work for a cause you’re actively involved with. A little work here and there is fine, but, for example, becoming an organization’s full-time web designer and being on the hook to work during your standard work day, etc, would not be OK."}, {"context": ". Not OK. You can’t work full time or part time for another company in our industry. If you’re unclear about what our industry is, and you have a specific situation you’d like to talk about, ping Jason or David. Go out on a regular speaking circuit tour which is going to require multiple days of travel multiple times a year. That’s too disruptive to our own work schedule and to your fellow teammates."}, {"context": ". Consult for other companies in our industry where there may be a conflict of interest (a competitor, a product tangentially related to 37signals, etc). Be aggressive in marketing your availability for side work. If something comes to you through a friend or some connection, fine, but aggressively promoting something on the side will ultimately result in a conflict of interest here at work."}, {"context": ". Take on anything outside of work that’ll pull attention from work. For example, if you wanted to launch an app, but the app requires providing timely customer support to people who use the app, that’s going to eat into your day here at work. That would ultimately be a problem."}, {"context": ". In general. Here are a few guiding principles about whether something could be a problem:. Is it competitive?. Does it occupy a disproportionate amount of your time?. Does it require you to be away during times when you’re needed at work?. Is it another paid gig that employs the same skills 37signals is paying you for?"}, {"context": ". In general, we’d like to be lenient within reason, but we’re going to be strict if we see it impact your time, attention, or performance here at work. It’s hard to come up with one-size fits all rules. If you’re in doubt, please reach out to your manager."}]}, {"title": "Our Internal Systems", "paragraphs": [{"context": "Besides the customer-facing applications, like the different versions of Basecamp, we have a number of internal systems that help us support, report, and operate the company. They are as follows:. Dash. Dash is the main hub for everything that has to do with logging (like finding why a request is slow or whether an email has been delivered), reporting (everything from number of support cases handled to split of devices used to access Basecamp), application health (response times, job queue exceptions etc)."}, {"context": "dash.37signals.com. Queenbee. Queenbee is our invoice, accounting, and identity system. Here you can look up any customer account, see whether they are comped, refund an invoice, or even login as a customer. That’s an immense amount of power and we take its use very seriously. We only ever login as a customer after having been given explicit permission to do so, never preemptively. Our customers expect that their information is confidential, even from us, and we intend to honor that expectation at all times."}, {"context": "billing.37signals.com. The 37 command. This is perhaps less of a system and more of an interface to all our other systems. The 37 command gives easy access to the production consoles for all the applications, which is often needed when diagnosing or fixing custom issues. It also allows you to directly grep and tail log files for live debugging, amongst other things."}, {"context": "github.com/basecamp/37. Sentry. We track programming exceptions on Sentry. When a customer hits a “Oops, something went wrong!” screen, that means there’ll be an entry in Sentry explaining to programmers why they saw that screen. Keeping the exceptions under control and monitored is primarily the responsibility of SIP and Jim via on-call."}, {"context": "getsentry.com. Customer.IO. All drip campaigns, welcome emails, and other email marketing campaigns for 37signals are run through Customer.IO. This allows the marketing team to independently tweak and measure the campaigns. customer.io. Shipshape. Shipshape is how we make sure our work computers are up to our strict security protocol. When you’re given access to the company’s GitHub account, you can run Shipshape to be sure you’re up to code. Shipshape will also test your machine periodically to let you know (and our SIP team know) if your machine springs a leak and needs bailing out."}, {"context": "github.com/basecamp/shipshape"}]}, {"title": "Benefits & Perks", "paragraphs": [{"context": "Health Insurance. Detailed information about all 37signals insurance policies and other benefits can be found in Basecamp. Medical Insurance. In the United States, medical insurance is provided through Blue Cross Blue Shield PPO. The company pays 75% of the premium and the employee pays the other 25%. Open enrollment is in November every year, with new coverage beginning December 1. Marriages and domestic partnerships are covered equally. You're eligible for coverage on your first day of employment. If you are terminated or resign from 37signals, your coverage will end on the last day of the month of your separation date and you may be eligible for continued coverage after that (COBRA)."}, {"context": "Each pay period, you’ll see a payroll deduction for medical insurance:. Employee-only medical coverage: $76.93. Employee-partner medical coverage: $160.26. Employee-child(ren) medical coverage: $171.29. Employee-family medical coverage: $254.61. Dental Insurance. Dental insurance in the US is provided through MetLife. The company pays 100% of the premium. Open enrollment is in November every year, with new coverage beginning December 1. Marriages and domestic partnerships are covered equally. You're eligible for coverage on your first day of employment. If you are terminated or resign from 37signals, your coverage will end on the last day of the month of your separation date and you may be eligible for continued coverage after that (COBRA)."}, {"context": "Vision Insurance. Vision insurance in the US is provided through MetLife. The company pays 100% of the premium. Open enrollment is in November every year, with new coverage beginning December 1. Marriages and domestic partnerships are covered equally. You're eligible for coverage on your first day of employment. If you are terminated or resign from 37signals, your coverage will end on the last day of the month of your separation date and you may be eligible for continued coverage after that (COBRA)."}, {"context": "Health Insurance for Staff Outside the US. If you’re outside of the US and pay out of pocket for private health insurance, you can request reimbursement for 75% of your insurance payments on your monthly invoice. Your monthly reimbursement is capped at the amount 37signals pays per employee per month on the US employee group plan. You may be asked to provide documentation to support your request for reimbursement."}, {"context": "Life Insurance. 37signals offers a $400,000 life insurance/AD+D policy to all staff through MetLife. The company pays 100% of the premium. You're eligible for coverage on your first day of employment, and it’s terminated automatically on your final day of employment. Open enrollment is in November every year, and participants are auto-enrolled at that time."}, {"context": "Retirement Plan. Our retirement plan for US employees is with Vanguard. 37signals matches 100% of what you contribute, up to 6% of your salary. You are eligible to enroll in the 401K plan with your first paycheck. If you're outside the US, 37signals will match what you contribute to a retirement account in your home country, up to 6% of your salary. In these cases, 37signals will pay you directly via your monthly invoice. It’s up to you to invest that payment and maintain administration of the retirement account and its taxes. You may be asked to provide documentation to support your request for a match."}, {"context": "Flexible Spending Account (FSA). The FSA is an account where you can set aside pre-tax money for out-of-pocket medical expenses, such as prescriptions, over-the-counter medicine, vision care, etc. You have to decide up front how much money you want to put in the account, and the max is $3,050/year. There is a separate type of FSA for dependent care, and the max for that plan is $5,000/year or $2,500/year if you split this with a partner. This is an entirely optional program. Open enrollment is in December every year, with new coverage beginning January 1. Both FSAs are with Paychex, our payroll provider."}, {"context": "Paid Time Off. Vacation Time. 37signals offers 18 days of paid time off plus 11 local holidays every year. We ask that you track your time off. Your vacation time is prorated based on your start date during your first year at 37signals. Your vacation time rolls over year to year with a maximum bank of 27 days at any time. If you are terminated or resign from 37signals with vacation days in your bank, you’ll be paid the monetary equivalent for those unused days (prorated at the time of your departure)."}, {"context": "Sabbatical. In addition to annual PTO and holidays, every three years employees may take a 30-day paid sabbatical. Give your team a heads-up preferably three months in advance so they can coordinate. If you’re terminated or resign from 37signals with an unused sabbatical, 37signals will pay you the monetary equivalent of those unused days only if your unused sabbatical was earned within the previous 12 months."}, {"context": "Sick Time. We don’t offer a bank of sick days nor do we ask you to track your sick days. However if you’re unexpectedly away from work due to illness or injury for more than 5 consecutive work days, you’ll transition from sick time to Personal Leave. 37signals does not pay out for unused sick time upon resignation or termination, since we have no sick time bank."}, {"context": "Your manager will check in with you if you’re consistently taking 3+ unplanned sick days per month. Excessive use of sick time may result in disciplinary measures. If you have a medical condition you know will take you away from work regularly, please work with your manager for accommodations. Personal Leave"}, {"context": "If you are unable to work for more than 1 week because of illness or injury, let your manager know as soon as you can. You can take four weeks off at 100% pay. If after 4 weeks, you’re still unable to work, your salary will drop to 70% for an additional 8 weeks. Your medical insurance will remain in force throughout your Leave. If after 12 weeks, you still cannot work, talk to your manager, and we will discuss what comes next on a case-by-case basis. You may be asked to provide medical documentation to support your request for Personal Leave, and Personal Leave is limited to one instance of paid leave per 12-month period."}, {"context": "Summer Hours. We work 4-day work weeks from May 1 through August 31 every year. An employee who has just been hired may have to complete a training program per their team lead to be eligible. When a holiday occurs during summer hours, you can take the holiday off or your normal summer day off. Any additional days off would count as vacation days."}, {"context": "Day of Service. 37signals also allows a Day of Service. You can take one day off every year to volunteer for a charitable or community organization of your choice. No need to use a vacation day or personal day, just let your team know you’ll be out. 37signals does not pay out for unused Days of Service if you resign or are terminated from 37signals."}, {"context": "Scheduling Time Off. 37signals doesn't have a formal time off request process. It's your responsibility to work with your manager and team to ensure coverage and manage your scheduled workload. The sooner you can inform your manager and team of your planned absence, the better, especially longer absences like sabbatical or long vacations. If your team has a defined process for scheduling time off, please follow that first."}, {"context": "The only time we ask you not to schedule discretionary time off is during a CODE. At 37signals, we assign a CODE when urgent work needs to be done. We have three levels of criticality. A CODE RED is an emergency, a CODE YELLOW is less immediate but still critical, and a CODE LAUNCH is called when we’re in the final stages of launching a new product. If we’re in the midst of one of these and you can delay your vacation or sabbatical until after the code has ended, please do."}, {"context": "Family Leave. If you become the primary caregiver of a child, you can take up to 16 weeks leave at 100% pay. If you become the secondary caregiver of a new child, you can take up to 6 weeks leave at 100% pay. You may choose to take an additional unpaid leave as the primary or secondary caregiver."}, {"context": "Some states require us to provide additional benefits. Bereavement Leave. When you lose a loved one, you can take paid time off from work for bereavement, making arrangements, settling family affairs, and attending the funeral or memorial service. Let your manager know your plans as soon as you can so they can arrange for your absence."}, {"context": "You can take ten days of bereavement leave for the death of a spouse or partner, child or child-in-law, parent or parent-in-law, or sibling or sibling-in-law. You can take three days of bereavement leave for the death of a grandparent, niece or nephew, cousin, or close friend. These caps are not to say you must return to work after so many days; you can use any of your available vacation time if you find you need more time off after bereavement leave. And if you know you’ll be away from work for much longer than outlined above, please talk to your manager to discuss that special case."}, {"context": "Employee Assistance Program (EAP). The 37signals EAP is through ComPsych, and it provides a confidential avenue for you to get assistance with issues regarding health, family, legal, financial, wellness or other personal matters. When you call or email ComPsych, you’ll be connected to a certified representative who can help you one-on-one at that time, or who can refer you to someone in your area for longer-term help. Services range from immediate or crisis mental health care to phone-help on your 401k investments to a referral to a lawyer in your area to help with your estate planning. Because we use the EAP, you also receive discounts on those referrals to professionals."}, {"context": "Pet Insurance. For your fur babies! 37signals doesn’t contribute to this plan at all, but everyone gets a 10% discount on this insurance you might otherwise buy. There are no set rates, and you can visit our portal on Figo’s website to get your quote and sign up. There’s no open enrollment period to sign up for pet insurance."}, {"context": "Employee Profit Sharing. 37signals shares 10% of its annual company profits with employees, which is distributed in shares based on tenure. Profits are distributed after the books are closed on the previous fiscal year, usually around March (e.g. 2022 profits distributed in March 2023). You’re eligible to participate in profit sharing after two years of working at 37signals. You’ll accrue one share per month starting on your second anniversary at 37signals, and you’ll max out your shares at 10 years. We calculate shares based on months of tenure so there’s no unfair cliff between being hired in December vs January."}, {"context": "We ask that you think of any compensation from this program as not something to be counted upon, not something to be budgeted with, but as a true bonus. Year to year, profits and therefore the amount we’re able to share with employees may swing wildly or not be paid out at all."}, {"context": "This Program does not have any set expiration date, but the company reserves the right to amend it or cancel it at any time. You forfeit your shares in the profit sharing program if you resign or are terminated from 37signals before the distribution date. Employee Liquidity Pool. There are no plans to sell 37signals or take the company public! But, in the slight chance of that happening, employees may be eligible to receive a portion of 10% of the value of the company if 37signals is sold or made public. That 10% would be divided into shares, and shares distributed amongst employees based on their tenure at the time of the sale/offering."}, {"context": "Employees are eligible for shares in the liquidity pool after two years of working at 37signals. You’ll accrue one share per month starting on your second anniversary, and you max out your shares after 10 years. We calculate shares based on months of tenure so there’s no unfair cliff between being hired in December vs January."}, {"context": "This Program does not have any set expiration date, but the company reserves the right to amend it or cancel it at any time. You forfeit your shares in the liquidity pool if you resign or are terminated from 37signals before the distribution date. Employee Gifts. At the end of every year, 37signals gives a thank-you gift to employees. The gift changes year to year and is not intended to be a year-end bonus."}, {"context": "Employees also receive a thank-you gift on their anniversaries with the company. Home Office Set-up. Since you work remotely, we want to make sure your home office is comfortable. During your first year at 37signals, you can expense up to $2,000 on things like a new desk, new desk chair, or other office furniture. This benefit expires on your first anniversary with the company."}, {"context": "Coworking Space Stipend. You can expense up to $200/month towards renting coworking space in your city. Please make sure you’re using a true coworking space that’s meant solely for working, not a club or social space like Soho House. . Everyone at 37signals has a subscription to Deskpass, a co-working desk reservation service. You can use Deskpass to find co-working spaces near you, and your $200/month benefit is pre-fixed in your account. You're not required to use Deskpass to use your co-working space benefit. Your Deskpass budget is capped at $200/mo, but none of that gets paid out unless you book a desk."}, {"context": "Expense Account. All staff carries a 37signals Visa card that you can use for work expenses like the benefits described above, software, computer equipment, meet-up travel, or office supplies. Check with your manager or Andrea if you have any doubts about whether or not a purchase qualifies as a work expense."}, {"context": "We use an expense management platform called Airbase. You're responsible for the monthly categorizing of your expenses and uploading receipts for purchases over $75. Full instructions on how to log your expenses in Airbase can be found in Basecamp. Overall, we trust our employees to spend money wisely. If you’re booking a meet-up flight, you don’t need to buy the cheapest, 2-layover redeye; buy the convenient, well-priced seat. If you’re attending a conference on behalf of 37signals, we’ll buy your meals. Just try to stay away from caviar and champagne at dinner (okay, maybe once if you have a great day to celebrate)."}, {"context": "Speaking of conferences — please limit your attendance at professional conferences to once a year. Don’t extend your hotel stay too far to either side of the conference schedule; you should be traveling specifically to attend the conf. Our conference budget guidelines mirror our mini meet-up budget guidelines; you can find those in Basecamp."}]}, {"title": "Titles for Designers", "paragraphs": [{"context": "We use the following criteria to assess the level and title of designers at Basecamp. These criteria aren’t exhaustive, and they aren’t mere checklists. We use the criteria as a guide for having individualized discussions about career progression. These criteria chiefly examine the scope of work someone is capable of tackling independently on a series of projects over an extended period of time (doing something well once isn’t enough to justify advancement). In addition to that assessment, we also look at the quality of the execution itself. Basecamp pays in the top 10% of the industry (based on San Francisco rates), so the quality of the work itself should be commensurate with that target."}, {"context": "Junior Designer. Work is thoroughly reviewed with substantial back-and-forth. Works primarily on tightly scoped, single element, routine problems with another designer. Follows existing design patterns, works within our existing look and feel. Usually less than 2 years of experience being a professional designer. WEB: Can write basic HTML/CSS with guidance. MOBILE: Can create prototypes w/ static screens."}, {"context": ". Designer. Work is reviewed with the occasional need for material direction or implementation changes. Works mostly on tightly scoped features, individual screens, or small problems with another designer. Usually at least 2-5 years of experience being a professional designer. WEB: Fully capable of writing modern HTML/CSS. MOBILE: Can create basic prototypes demonstrating interactions and animations."}, {"context": ". Senior Designer. Work doesn’t necessarily need to be reviewed, but general approach may be. Can run point on small batch projects, taking them from concept to shipping as the sole designer (alongside a programmer). Can occasionally run point on large batch projects, sometimes with assistance. Usually at least 5-8 years of experience being a professional designer."}, {"context": "WEB: Fully capable of writing modern HTML/CSS and basic proficiency in Javascript. MOBILE: Can create detailed interactive prototypes demonstrating flows, interactions, and animations. Lead Designer. Work happens completely autonomously without regular need for review. Can run point on large batch projects, taking them from concept to shipping as the sole designer (alongside a programmer)."}, {"context": "Can lead a small department or longer-term initiative. Helps set and maintain professional standards for the entire organization. Makes regular, material contributions to the look-and-feel of our general aesthetic and brand. Usually at least 8-12 years of experience being a professional designer. Typically at least 3-5 years experience at Basecamp internalizing how we work."}, {"context": "WEB: Fully capable of writing modern HTML/CSS/JS + the ability to make moderate progress in Rails. MOBILE: Can create detailed interactive prototypes demonstrating flows, interactions, and animations. Principal Designer. Can run point on our most complex, critical, big batch projects, taking them from concept to shipping as the sole designer (alongside one or more programmers)."}, {"context": "Leads major product redesigns (from version 2 to 3, 3 to 4, etc). Can spin up new concepts and prototype new products from scratch. Regularly publishes and shares design process insights inside and outside the company. Moves the industry forward by introducing novel techniques, approaches, or ideas. Completely comfortable discussing complex application logic with programmers."}, {"context": "Usually at least 12-15+ years of experience being a professional designer. Typically at least 5-7 years experience at Basecamp internalizing how we work. WEB: Fully capable of writing their own HTML/CSS/JS + the ability to make significant progress in Rails. WEB: Can spin up new Rails apps from scratch, and make initial progress without outside help."}, {"context": "MOBILE: Can create detailed interactive prototypes demonstrating flows, interactions, and animations. MOBILE: Can work in native environments and put together their own app from scratch."}]}, {"title": "We’re happy for others to use this handbook as inspiration for their own organizations! The structure is fair game to copy. However, please don’t use our words exactly if you are making your own handbook. Personalize to match your own organization, including of course the examples. Thanks!", "paragraphs": [{"context": "(And yes, we realize this isn’t an officially recognized open-source license.)"}]}, {"title": "Getting Started", "paragraphs": [{"context": "Getting started at 37signals involves a lot of little details, a number of big tasks, learning the details of your new job, meeting new coworkers, all while working remotely. Your teammates, your manager, your 37signals buddy, your Ops buddy, and our People team are all here to help as you navigate your first few days and weeks."}, {"context": "Your First Few Days. Before you start, Andrea will order you a new laptop with the specs you request and any accessories you need like an external keyboard, mouse, or display. Get what you need, while keeping in mind the demands of your work when choosing specs. A day or two before you start, your manager will email you instructions for your first day. Your manager will be your point of contact for your early projects and activities. You'll also work with a member of our Ops team who will help you as you set up all the accounts you need to work at 37signals. "}, {"context": "On your first day, you'll log into Basecamp to see a project dedicated to your onboarding called “Welcome, [your name]!”. Your welcome project will contain  a few to-do lists linking to accounts or services that you need to set up to get started. You’ll also see to-do lists that your Ops buddy and manager will be working through. Your Ops buddy and your manager will be in contact with you as you set up your environment, should you have questions or get stuck. "}, {"context": "The accounts you're asked to set up depend on the role you've been hired for. But everyone at the company is asked to follow a stringent and specific security protocol, which we monitor after set-up using Shipshape 🔒. Here’s a list 🔒 of what we require and why we require it."}, {"context": "Your training schedules and onboarding expectations will be in your welcome project. You'll also find docs with helpful links to technical documentation, walkthrough videos, important Basecamp projects, and more. Your welcome project will also contain a list of people to meet over the course of your first few weeks. * your manager. You and your manager will meet on your first day to sort out a recurring 1:1 schedule and to review your specific onboarding expectations."}, {"context": "* your team. Most teams have a weekly call which you'll join your first week. . * your 37signals buddy. Your buddy will be someone who’s not on your immediate team, who’s worked at 37signals for a while, and who can point you in the right direction when you have a question and don’t quite know where to turn. They’ll introduce themselves during your first week, to say hi and offer their help. They’ll check in with you periodically throughout your first couple months to see how you’re settling in."}, {"context": "* People Ops. You'll meet with Andrea to review 37signals policies, benefits, and compensation. . After your environment has been set up, expectations are clear, and you've met who you need to meet, you'll get to work! You'll begin working on real projects, with plenty of support and guidance, within your first week. Your responsibilities and impact will increase as you learn and gain confidence over the next few months, and most people are up to speed and feeling fully part of the team in about 3 months."}]}, {"title": "Making A Career", "paragraphs": [{"context": "Your First 90 Days. Congratulations! You’re part of the team!. In your first 90 days, you’ll be getting aligned with your manager on approach and expectations. You’ll get up and running, do real work, in real circumstances, with real coworkers, for long periods of time. It’s your manager’s responsibility to give you proper opportunities to demonstrate your skills and fit for the job. This includes your technical expertise, your engagement with coworkers, and your ability to take feedback and adapt to the 37signals culture. Similarly, it’s on you to take advantage of those opportunities, and to show that you’re capable of meeting the team standards."}, {"context": "When you start, you’ll receive an outline of expected performance metrics for your first 3 months. Those standards will be clear and attainable, and your manager will give you frequent, candid feedback. On occasion, despite our collective best efforts, it’s not a fit. We don’t do full-scale performance improvement plans during the first three months. So if during that time it starts looking like your long-term employment won’t work out, your manager will let you know early and why."}, {"context": "We hope, and fully expect, that your first 90 days will confirm what we learned in the hiring phase — you’re well suited for this job, this team, and you’re invigorated by the work to be done. Just put in your best effort, make sure you reach out if things aren’t feeling right, embrace the feedback you get from your manager, and openly share your feedback with them!"}, {"context": "Mastery & Titles. Advancing your career at 37signals doesn’t mean giving up on your craft. No matter your role, you can become better at the work itself and level-up that way. This is especially important since we’re a relatively small company with few layers of managerial cake. Within each of our job functions, we’ve mapped our trajectory of mastery to five different levels. That title structure is shared amongst all departments, but the particulars of what characterizes one level from another will of course be different. Here’s an example of the titles for programming:"}, {"context": ". Junior Programmer. Programmer. Senior Programmer. Lead Programmer. Principal Programmer. While this is how we recognize mastery, it’s by no means an expectation that everyone will start as a junior and end up as a principal. 37signals needs people and perspectives from all levels of skill. And for those who do end up progressing all the way through this path, it may well be a journey of many, many years, if not a decade+."}, {"context": "But these titles make it clear to everyone where someone is in their career progression at 37signals. Note that these titles are about a particular role at 37signals. Someone may well have been a “Senior Designer” somewhere else with a different assessment criteria and a different workflow, and then still start at 37signals as a “Designer”. We recognize mastery and titles at 37signals for the work done at 37signals."}, {"context": "Day to day, though, these titles aren’t really much of a factor. But they do give newcomers another way of orienting themselves at the company and it gives everyone a clear way of tracking their personal career progression at 37signals. You can see the specific titles and proficiencies expected for: Designers, Ops, Programmers, Support, Data."}, {"context": "Pay & Promotions. 37signals pays at the top 10% for our industry at San Francisco salary levels, regardless of where you live. The comparison data is provided by a company called Radford that polls compensation data from all the major companies in our industry and plenty of our smaller peers as well. Because we don’t pay bonuses, we match our base compensation to the base + bonus of our peer group."}, {"context": "Some jobs at 37signals are not matched to Radford comparison data. Compensation for common technical roles like programming and design is reliably competitive in a market like San Francisco. For some non-technical roles, compensation is much lower, much less competitive. To compensate for that industry disparity, we instituted a $73,500 salary floor (floor adjusted for inflation since publishing)."}, {"context": "The Radford data is reviewed once per year at the end of November. If it’s warranted, that is if the market rates in the top 10% have gone up, we’ll increase pay on January 1st to follow suit. We don’t decrease pay, even if the market rates may have dropped. If that happens, we’ll hold them steady until they come up again."}, {"context": "In addition to raises based on Radford market data, we’ve also in the past given raises in excess of those based on core price index inflation numbers, if the market didn’t move upward. This is not a guaranteed practice. Everyone in the same role at the same level is paid the same at 37signals."}, {"context": "When you get a promotion, that is you move from one level to another, you’ll get a corresponding pay raise effective on your next pay cycle. Performance Reviews. You’ll meet with your manager for formal performance reviews. When you're new to 37signals, you'll meet at the 3-month, 6-month, and 1-year marks. Then you'll meet once a year, around your anniversary with the company. Your manager will share performance expectations for your role when you start, and they'll keep you apprised of any changes to expectations should they evolve."}, {"context": "Managers are expected to document performance review outcomes and any action items or deadlines that come out of the meetings. Performance Improvement Plans. If your work performance is not meeting expectations, you may be put on a Performance Improvement Plan (PIP). We only initiate PIPs if your manager’s concern is correctable in the short term. We do not initiate PIPs for fundamental performance issues that relate to your core job skills. If you’re a Programmer whose coding skills are not at the level they need to be, we’d forego a PIP. However we may initiate a PIP to help you improve your performance in a coachable skill like project management. In those cases, we’ll follow our performance plan process."}]}, {"title": "Our Rituals", "paragraphs": [{"context": "Meetups. The entire company gathers in person twice a year. We meet up in a different city every time. In 2022, we traveled to Miami and Amsterdam. Most of the planning is taken care of for you; you just need to book your flights. Lodging, meeting space, agenda, and social outings will be planned and communicated well in advance."}, {"context": "In general, our meetups are largely unstructured. Every morning, we gather for breakfast at 8am. There are some scheduled talks, like the welcome session on Monday morning, lightning talks, and peer appreciation session. Occasionally, we bring in outside speakers or trainers. Other than that, the meet-up is intentionally loose. Teams huddle in a breakout room, groups go out for coffee or to explore the city, or managers meet 1:1s with employees. Connection and fellowship is always the #1 goal of any meetup, which we accomplish in different ways throughout the week."}, {"context": "Meeups are 1 week long. Most people arrive Sunday, we meet Monday through Thursday, and then we travel home on Friday. Everyone should come to every meet-up, but skipping one here and there is okay if you have an engagement you can’t cancel. It's important to note that meet-ups can be overwhelming when we're so used to working on our own and virtually. But meetups are also rewarding and energizing, and you'll probably find yourself looking forward to the next one within weeks of returning home."}, {"context": "Mini Meetups. Once a year, you can get together with a small group of your coworkers on a mini meet-up at a destination of your choosing. Mini meet-ups should have a work focus. They’re not meant to be social trips, and you’re not doing just your day-to-day work in the same room as your coworkers. You should be collaborating on something meaningful. It certainly doesn’t have to be big and you don’t have to produce something by the end of the meet-up. Pick something you’d love to have a week to discuss in person and have fun with it."}, {"context": "Keep in mind: your mini-meet-up team does not have to be your formal team like Ops, Support, Mobile, etc. Colleagues who are working cross-team who have a project to get together on can meet-up too. Limit yourself to 1 mini-meet-up per year though, whether that’s with your dedicated team or with an offshoot team."}, {"context": "Budget guidelines for mini meet-ups can be found in Basecamp. Everyone on Support (EOS). Once every month or two, everyone in the company is given the opportunity to do a Customer Support shift. We call it Everyone on Support (EOS). Talking directly to customers all day helps us realize what’s wrong and what’s right with our products. For the first few times you do EOS, you’ll have a Support buddy to help you write clear and correct answers to customer questions through Help Scout, our support response tool, and then you’re on your own!"}]}, {"title": "37signals Is You", "paragraphs": [{"context": "Everyone working at 37signals represents 37signals. When a customer gets a response from Merissa on support, Merissa is 37signals. When a customer reads a tweet by Eron that our systems are down, Eron is 37signals. In those situations, all the other stuff we do to cultivate our best image is secondary. What’s right in front of someone in a time of need is what they’ll remember."}, {"context": "That’s what we mean when we say marketing is everyone’s responsibility, and that it pays to spend the time to recognize that. This means avoiding the bullshit of outage language and bending our policies, not just lending your ears. It means taking the time to get the writing right and consider how you’d feel if you were on the other side of the interaction."}, {"context": "The vast majority of our customers come from word of mouth and much of that word comes from people in our audience. This is an audience we’ve been educating and entertaining for 20 years and counting, and your voice is part of us now, whether you like it or not! Tell us and our audience what you have to say!"}, {"context": "This goes for tools and techniques as much as it goes for prose. 37signals not only tries to out-teach the competition, but also out-share and out-collaborate. We’re prolific open source contributors through Ruby on Rails, Trix, Turbolinks, Stimulus, and many other projects. Extracting the common infrastructure that others could use as well is satisfying, important work, and we should continue to do that."}, {"context": "It’s also worth mentioning that joining 37signals can be all-consuming. We’ve seen it happen. You dig 37signals, so you feel pressure to contribute, maybe overwhelmingly so. The people who work here are some of the best and brightest in our industry, so the self-imposed burden to be exceptional is real. But here’s the thing: stop it. Settle in. We’re glad you love this job because we all do too, but at the end of the day it’s a job. Do your best work, collaborate with your team, write, read, learn, and then turn off your computer and play with your dog. We’ll all be better for it."}]}], "version": "private-domain"}